from regex_check import match_check as mc

mc('a.b', 'a0b') # T
mc('a.b', 'a00b') # F
mc('a.b', 'aaab') # T
mc('a.b', 'acb') # T
mc('a.b', 'accb') # F

print('-----------------------------------------------')

mc('a.b', 'a\nb') # F (\n은 하나의 문자로 취급하지 않는다.)
mc('a.b', 'a\tb') # T 
mc('a.b', 'a b') # T
mc('a.b', 'a    b') # F (탭은 하나의 문자로 취급)
mc('a.b', 'a\n\tb') # F

print('-----------------------------------------------')

mc('a..b', 'a  b') # T
mc('b..k', 'book') # T
mc('이.현', '이수현') # T
mc('이.현', '이정현') # T

print('-----------------------------------------------')

mc('해파리', '123해파리123') # T
mc('해파리[.]', '해파리.') # T
mc('해[.]파리', '해.파리') # T
mc('해[.]파리', '해8파리') # F
mc('해[.]파리', '해\n파리') # F
