pattern_dict = {
    # 01X-XXX(X)-XXXX
    'mobile' : '^(01[0|1|6|9])-(\d{3,4})-(\d{4})$',
    # (대소문자, 숫자, ._%+- )@(대소문자 ,숫자, -. ).(대소문자 2글자 이상)
    'email': '^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9-.]+\.[a-zA-Z]{2,}$',
    # 아이피 주소 [ipv4] 0~255.0~255.0~255.0~255
    'ip': '^([0-9]{1,3}\.){3}[0-9]{1,3}$',
    # URL 'http|https :// 주소.co.kr
    'url': '^https?:\/\/[\w.-]+\.[a-zA-Z]{2,}$',
    # 날짜 yyyy-mm-dd '^\d{4}-\d{2}-\d{2}$'
    'date': '^[0-9]{4}-(0[1-9]|1[0-2])-(0[1-9]|[1-2][0-9]|3[0|1])$',
    # 시간 hh:mm:ss '^\d{2}:\d{2}:\d{2}$' [hh 00~23] [mm,ss 00~59]
    'time': '^([0-1]\d|2[0-3])(:[0-5][0-9]){2}$',
    # 비밀번호 [소문자, 대문자, 숫자, 특수문자(?!@#$%^&*)] / 최소길이 6, 최대길이 30
    'password' : '[a-zA-Z0-9?!@#$%^&*]{6,30}'
}