const Service = () => {
    return ( 
        <main className="Layout-main">
            <h1>제공되는 서비스</h1>
            <span>"우리는 고객들에게 더 나은 경험을 제공하기 위해 다양한 서비스를 제공합니다. 신속한 배송, 간편한 교환 및 환불 정책, 그리고 친절하고 전문적인 기술 지원을 통해 고객들의 만족을 최우선으로 생각합니다."</span>
            <span>"우리의 서비스를 이용하면 편리성과 안전성을 높일 수 있습니다. 신속한 배송으로 고객님들의 소중한 시간을 절약하고, 탁월한 교환 및 환불 정책으로 고객님들의 만족도를 높일 수 있습니다."</span>

            <h2>서비스 이용 방법</h2>
            <span>"서비스를 이용하는 방법은 매우 간단합니다. 제품을 구매한 후에는 웹사이트에서 배송 상태를 확인할 수 있으며, 교환 및 환불을 위한 절차는 온라인으로 간편하게 진행할 수 있습니다."</span>

            <h3>자주 묻는 질문 (FAQ)</h3>
            <span>"고객님들의 궁금증을 해결하기 위해 자주 묻는 질문과 답변을 모았습니다. 궁금한 사항이 있으시면 FAQ 페이지를 참고해주세요."</span>
            <div><a href="/FAQ">FAQ 페이지</a></div>

            <h3>고객 지원</h3>
            <span>"고객님들의 소중한 의견과 문제를 해결하기 위해 우리의 고객 서비스팀이 항상 준비되어 있습니다. 언제든지 전화, 이메일 또는 온라인 채팅으로 연락해주시면 친절하고 빠른 지원을 받으실 수 있습니다."</span>
        </main>
    );
}

export default Service;